InformationRegisters/ОшибкиЗагрузкиДанныхИзОчередиAMQP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиЗагрузкиДанныхИзОчередиAMQP</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НужноОбработать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МоментОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбъектаМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяСопутствСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМДМСопутствСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Р_ТипыВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Р_ТипыВходящихСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Р_ВходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Р_ВходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработаноСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗагруженныхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокПовторнойОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Р_ТипыВходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодпискиНаОчередиСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПотока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПолучениеСообщенийСлужебный/Ext/Module.bsl
//////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Создает таблицу обработчиков событий очередей
//
Функция ПолучитьКоллекциюРегистрацииОбработчиков() Экспорт
	
	КоллекцияРегистрацииОбработчиков = Новый Соответствие;
	
	Возврат КоллекцияРегистрацииОбработчиков;
	
КонецФункции

// Добавляет обработчик события из очереди
//
Процедура ДобавитьОбработчикСобытия(Знач Обработчики, Знач ИмяОчереди, Знач ИмяПроцедуры) Экспорт
	
	КоллекцияОбработчиков = Обработчики[ИмяОчереди];
	
	Если КоллекцияОбработчиков = Неопределено Тогда
		
		КоллекцияОбработчиков = Новый Массив;
		Обработчики[ИмяОчереди] = КоллекцияОбработчиков;
		
	КонецЕсли;
	
	КоллекцияОбработчиков.Добавить(ИмяПроцедуры);
	
КонецПроцедуры

// Добавляет обработчик события из очереди
//
Процедура ДобавитьОбработчикСобытияАсинх(Знач Обработчики, Знач ИмяОчереди, Знач ИмяМетода, Знач ИмяПроцедуры) Экспорт
	
	КоллекцияОбработчиков = Обработчики[ИмяОчереди];
	
	Если КоллекцияОбработчиков = Неопределено Тогда
		
		КоллекцияОбработчиков = Новый Соответствие;
		Обработчики[ИмяОчереди] = КоллекцияОбработчиков;
		
	КонецЕсли;
	
	КоллекцияОбработчиков.Вставить(ИмяМетода, ИмяПроцедуры);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ РЕГЛАМЕНТНЫХ ЗАДАНИЙ

Процедура ПолучитьСообщение(Знач ИмяОчереди, Знач ИнтервалОжидания) Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("ПолучениеСообщений.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	Если Не Константы.AMQP_ИспользоватьЗагрузкуСправочниковИзМДМ.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Получатель = ОчередьСообщений.НовыйПодписчик(ИмяОчереди);
	
	Данные = Неопределено;
	
	НомерСообщения = "";
	
	// Ограничиваем количество сообщений, обрабатываемых за 1 сессию
	КоличествоОбрабатываемыхСообщений = Константы.AMPQ_КоличествоОбрабатываемыхСообщений.Получить();
	
	Если КоличествоОбрабатываемыхСообщений = 0 Тогда
		НетОграниченияКоличестваСообщений = Истина;
	Иначе
		НетОграниченияКоличестваСообщений = Ложь;
	КонецЕсли;		
	
	Инд = 0;
	ИО = "";
	
	НомерСообщения = "";	
	СвойстваСообщения = "";	
	ИмяПриложения = "";     
	
	Пока Получатель.ПолучитьСообщение(Данные, ИнтервалОжидания * 1000, НомерСообщения, СвойстваСообщения)  
		и (НетОграниченияКоличестваСообщений ИЛИ Инд < КоличествоОбрабатываемыхСообщений) Цикл
		
		Инд = Инд + 1;
		
		Попытка
			
			ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,,
				СтрШаблон(НСтр("ru = 'Получено сообщение из очереди %1'"), ИмяОчереди));
			
			Отказ = Ложь;

			Если ИО = "" тогда
				
				ИО = Лев(ИмяОчереди, Найти(ИмяОчереди, ".") - 1);
				
				Если ИО = "" Тогда
					ИО = ИмяОчереди;	
				КонецЕсли; 
				
			КонецЕсли;
			
			ИмяПриложения = "";
			
			Если СоздаватьСообщение(ИмяОчереди, ИмяПриложения) Тогда
				СоздатьСообщение(Перечисления.Р_ТипыВходящихСообщений.Документ, ИмяПриложения, СвойстваСообщения, ИмяОчереди, Данные, Инд, Отказ);
			Иначе	
				МСК.ОбработатьСообщениеИзОчереди(ИО, Данные, Отказ);
			КонецЕсли;
			
			Если Не Отказ Тогда
				Получатель.СообщениеОбработано();
			Иначе
				Получатель.ОтклонитьСообщение();
			КонецЕсли;
			
		Исключение
									
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка обработки сообщения очереди %1.'"), ИмяОчереди) + "
			|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗаписьЖурналаРегистрации(
				"ПолучениеСообщений.Ошибка",
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ТекстОшибки);
				
				ИнфоОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				КоличествоПопытокОбработки = 0;
				
				Если Найти(ИнфоОбОшибке, "ВидДокумента ПоступлениеБезналичныхДенежныхСредств") > 0 Тогда
					
					КоличествоПопытокОбработки = 1;
					
					Если Найти(ИнфоОбОшибке, "Не найден контрагент по ГУИД") Тогда
						
						Получатель.СообщениеОбработано();
						Продолжить;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
				Если НЕ Данные = Неопределено Тогда
				
					МЗ = РегистрыСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP.СоздатьМенеджерЗаписи();
					МЗ.МоментОшибки = ТекущаяДата() + 1;
					МЗ.ТекстОшибки = ТекстОшибки;
					МЗ.ОписаниеОшибки = Данные;
					МЗ.НомерСообщения = НомерСообщения;
					МЗ.НужноОбработать = Истина;
					МЗ.ИмяОчереди = ИмяОчереди;
					МЗ.КоличествоПопыток = КоличествоПопытокОбработки;
					МЗ.Записать(); 
					
					СтруктураСообщения = Новый Структура;
					СтруктураСообщения.Вставить("service", "doc-order-assemble");
					СтруктураСообщения.Вставить("error", ТекстОшибки);
					СтруктураСообщения.Вставить("body", Данные);
					СтруктураСообщения.Вставить("solved", false);
					
					СвойстваСтруктура = Новый Структура;
					СвойстваСтруктура.Вставить("app_id", Лев(ИмяОчереди, Найти(ИмяОчереди, ".") - 1));    					
					СтруктураСообщения.Вставить("props", СвойстваСтруктура); 					
					
					AMQP_РаботаСоСправочниками.ОтправитьСообщениеВЭластик(СтруктураСообщения, НомерСообщения, Истина);
					
					Получатель.СообщениеОбработано();
				
			КонецЕсли;
				
		КонецПопытки;
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("ПолучениеСообщений.Завершение", УровеньЖурналаРегистрации.Информация,,,
				СтрШаблон(НСтр("ru = 'Получены все сообщения из очереди %1'"), ИмяОчереди));
	
КонецПроцедуры

Процедура ПолучитьСообщениеАсинх(Знач ИмяОчереди, Знач ИнтервалОжидания = 0) Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("ПолучениеСообщений.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ОбработчикиСообщений = ПолучитьОбработчикиСообщенийАсинх();
	
	Если ОбработчикиСообщений.Количество() = 0 Тогда
		
		ЗаписьЖурналаРегистрации("ПолучениеСообщений.Ошибка", УровеньЖурналаРегистрации.Предупреждение,,,
				НСтр("ru = 'В системе не зарегистрировано обработчиков сообщений'"));
		Возврат;
		
	КонецЕсли;
	
	Получатель = ОчередьСообщений.НовыйАсинхронныйСервис(ИмяОчереди);
	КоллекцияОбработчиков = ОбработчикиСообщений[ИмяОчереди];
	
	Если Не ЗначениеЗаполнено(КоллекцияОбработчиков) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестное имя очереди %1'"), ИмяОчереди);
	КонецЕсли;
	
	Для каждого Элемент из КоллекцияОбработчиков Цикл
		Получатель.ДобавитьМетод(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Получатель.СлушатьВызовы();
	
	ЗаписьЖурналаРегистрации("ПолучениеСообщений.Завершение", УровеньЖурналаРегистрации.Информация,,,
				СтрШаблон(НСтр("ru = 'Получены все сообщения из очереди %1'"), ИмяОчереди));
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////
// Служебные процедуры

Функция ПолучитьОбработчикиСообщений() Экспорт
	
	Коллекция = ПолучитьКоллекциюРегистрацииОбработчиков();
	ПолучениеСообщенийПереопределяемый.ПриРегистрацииОбработчиковСообщений(Коллекция);
	
	Возврат Коллекция;
	
КонецФункции

Функция ПолучитьОбработчикиСообщенийАсинх()
	
	Коллекция = ПолучитьКоллекциюРегистрацииОбработчиков();
	ПолучениеСообщенийПереопределяемый.ПриРегистрацииОбработчиковСообщенийАсинх(Коллекция);
	
	Возврат Коллекция;
	
КонецФункции

Функция СоздаватьСообщение(ИмяОчереди, ИмяПриложения)
	
	Если ВРЕГ(Лев(ИмяОчереди, 4)) = "UT10" И ВРЕГ(Прав(ИмяОчереди, 13)) = ".DOCUMENTS.SM" Тогда
		
		ИмяПриложения = "SM";
		Возврат Истина;
		
	ИначеЕсли ВРЕГ(Лев(ИмяОчереди, 4)) = "UT10" И ВРЕГ(Прав(ИмяОчереди, 9)) = ".PRICE.PM" Тогда
		
		ИмяПриложения = "PM";
		Возврат Истина;

	ИначеЕсли ВРЕГ(ИмяОчереди) = "UT10.DOCUMENTS.MARK" Тогда
		
		ИмяПриложения = "MARK";  
		Возврат Истина;
		
	ИначеЕсли ВРЕГ(Лев(ИмяОчереди, 4)) = "UT10" И ВРЕГ(Прав(ИмяОчереди, 15)) = ".DOCUMENTS.MARK" Тогда
		
		ИмяПриложения = "MARK";  
		Возврат Истина;    
		
	//+Белов А. 14.09.2026 #UT10-6038
	ИначеЕсли ВРЕГ(Лев(ИмяОчереди, 4)) = "UT10" И ВРЕГ(Прав(ИмяОчереди, 15)) = ".DOCUMENTS.UT10" Тогда
		
		ИмяПриложения = "UT10";  
		Возврат Истина;    
	//-Белов А. 14.09.2026 #UT10-6038

	Иначе
		Возврат Ложь;
	КонецЕсли;	 

КонецФункции // ()

Процедура ОбработатьСообщение(Знач Данные, Знач Обработчик, Отказ) Экспорт
	
	Выполнить(Обработчик + "(Данные, Отказ)");
		
КонецПроцедуры

Процедура СоздатьСообщение(ТипСообщения, ИмяПриложения, СвойстваСообщения, ИмяОчереди, Данные, Инд, Отказ) Экспорт
	
	НовыйЭлемент = Справочники.Р_ВходящиеСообщения.СоздатьЭлемент();
	
	Если ТипЗнч(СвойстваСообщения) = Тип("Структура") Тогда  
		СвойстваСообщения.Свойство("headers", СвойстваСообщения); 
	КонецЕсли;
		
	Если ТипЗнч(СвойстваСообщения) = Тип("Соответствие") Тогда
		
		Для каждого Ключ Из СвойстваСообщения Цикл 
			
			НСтр = НовыйЭлемент.Параметры.Добавить();
			НСтр.Имя = Строка(Ключ.Ключ);
			НСтр.Значение = Строка(Ключ.Значение);	
			
		КонецЦикла;           
		
	КонецЕсли;
	
	ИмяРегистра = "";
	
	НовыйЭлемент.ИмяПриложения = ИмяПриложения;
	НовыйЭлемент.НомерПоПорядку = Инд;
	НовыйЭлемент.Дата = ТекущаяДата();
	НовыйЭлемент.Наименование = "Сообщение от " + Строка(НовыйЭлемент.Дата); 
	НовыйЭлемент.Данные = Данные;    
	НовыйЭлемент.ТипСообщения = ТипСообщения; 
	НовыйЭлемент.Подписка = Справочники.ПодпискиНаОчередиСообщений.НайтиПоНаименованию(ИмяОчереди, Истина); 
	
	Попытка
		
		Если ТипСообщения = Перечисления.Р_ТипыВходящихСообщений.Справочник Тогда
			Возврат;
			
		ИначеЕсли ТипСообщения = Перечисления.Р_ТипыВходящихСообщений.Документ Тогда
			
			ИмяОбъектаМетаданных = МСК.ПолучитьИмяОбъектаМетаданныхПоСообщению(НовыйЭлемент);	
			НовыйЭлемент.ИмяОбъектаМетаданных = ИмяОбъектаМетаданных;
			
			Если ИмяОбъектаМетаданных = "УстановкаЦенНоменклатурыКонтрагентов" И ИмяПриложения = "PM" Тогда
				НовыйЭлемент.КодИсточника = "";	
			Иначе
				НовыйЭлемент.КодИсточника = МСК.ПолучитьКодИсточникаПоСообщению(НовыйЭлемент); 
			КонецЕсли;
		
		ИначеЕсли ТипСообщения = Перечисления.Р_ТипыВходящихСообщений.Регистр Тогда
			
			НовыйЭлемент.ИмяОбъектаМетаданных = ИмяРегистра;	   
			Возврат;
			
		КонецЕсли;					
		
	Исключение
	КонецПопытки;
	
	Попытка
		НовыйЭлемент.Записать(); 
	Исключение
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка обработки сообщения очереди %1.'"), ИмяОчереди) + "
		|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(
		"ПолучениеСообщений.Ошибка",
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстОшибки);  
		
	КонецПопытки; 
	
КонецПроцедуры
